Resources/canonical_library/wsdl/Update.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?><wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:p1="http://test.sap.com/ZUDI" xmlns:p2="https://services.ird.govt.nz/GWS/Employment/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" name="Update" soap:location="http://www.example.org/" targetNamespace="http://test.sap.com/ZUDI" wsdlsoap:location="http://www.example.org/"><wsdl:documentation/><wsp:UsingPolicy wsdl:required="true"/><wsp:Policy wsu:Id="OP_Update"/><wsdl:types><xsd:schema xmlns="https://services.ird.govt.nz/GWS/Employment/" xmlns:q5="https://services.ird.govt.nz/GWS/Employment/:types/UpdateRequest" xmlns:q6="https://services.ird.govt.nz/GWS/Employment/:types/UpdateResponse" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="https://services.ird.govt.nz/GWS/Employment/"><xsd:import namespace="https://services.ird.govt.nz/GWS/Employment/:types/UpdateRequest"/><xsd:import namespace="https://services.ird.govt.nz/GWS/Employment/:types/UpdateResponse"/><xsd:element name="Update"><xsd:complexType><xsd:sequence><xsd:element form="qualified" name="UpdateRequestMsg" nillable="true" type="q5:UpdateRequestType"/></xsd:sequence></xsd:complexType></xsd:element><xsd:element name="UpdateResponse"><xsd:complexType><xsd:sequence><xsd:element form="qualified" minOccurs="0" name="UpdateResult" nillable="true" type="q6:UpdateResponseType"/></xsd:sequence></xsd:complexType></xsd:element></xsd:schema><xsd:schema xmlns="https://services.ird.govt.nz/GWS/Employment/:types/UpdateRequest" xmlns:emp="urn:www.ird.govt.nz/GWS:types/Employment" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="https://services.ird.govt.nz/GWS/Employment/:types/UpdateRequest"><xsd:import namespace="urn:www.ird.govt.nz/GWS:types/Employment"/><xsd:complexType name="UpdateRequestType"><xsd:sequence><xsd:element form="qualified" name="UpdateRequestWrapper" nillable="true"><xsd:complexType><xsd:sequence><xsd:element ref="emp:updateRequest"/></xsd:sequence></xsd:complexType></xsd:element></xsd:sequence></xsd:complexType></xsd:schema><xsd:schema xmlns="https://services.ird.govt.nz/GWS/Employment/:types/UpdateResponse" xmlns:emp="urn:www.ird.govt.nz/GWS:types/Employment" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="https://services.ird.govt.nz/GWS/Employment/:types/UpdateResponse"><xsd:import namespace="urn:www.ird.govt.nz/GWS:types/Employment"/><xsd:complexType name="UpdateResponseType"><xsd:sequence><xsd:element form="qualified" name="UpdateResponseWrapper" nillable="true"><xsd:complexType><xsd:sequence><xsd:element ref="emp:employmentResponse"/></xsd:sequence></xsd:complexType></xsd:element></xsd:sequence></xsd:complexType></xsd:schema></wsdl:types><wsdl:message name="p2.Employment_Update_InputMessage"><wsdl:documentation/><wsdl:part element="p2:Update" name="parameters"/></wsdl:message><wsdl:message name="p2.Employment_Update_OutputMessage"><wsdl:documentation/><wsdl:part element="p2:UpdateResponse" name="parameters"/></wsdl:message><wsdl:portType name="Update"><wsdl:documentation/><wsdl:operation name="Update"><wsdl:documentation/><wsp:Policy><wsp:PolicyReference URI="#OP_Update"/></wsp:Policy><wsdl:input message="p1:p2.Employment_Update_InputMessage"/><wsdl:output message="p1:p2.Employment_Update_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="UpdateBinding" type="p1:Update"><soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="Update"><soap:operation soapAction="http://sap.com/xi/WebService/soap1.1"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="Update"><wsdl:port binding="p1:UpdateBinding" name="Update"><soap:address location="http://www.example.org/"/></wsdl:port></wsdl:service></wsdl:definitions>