Payday Filing/Employee Details/Archive/20180521/UpdateRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
xmlns:empl="https://services.ird.govt.nz/GWS/Employment/"
xmlns:upd="https://services.ird.govt.nz/GWS/Employment/:types/UpdateRequest"
xmlns:a="http://www.w3.org/2005/08/addressing">
   <soap:Header>
   </soap:Header>
   <soap:Body>
      <empl:Update>
         <empl:UpdateRequestMsg>
            <upd:UpdateRequestWrapper>
              <emp:updateRequest
               xmlns:emp="urn:www.ird.govt.nz/GWS:types/Employment"
               xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v1">
				<emp:header>
					<cmn:softwareProviderData>
						<cmn:softwareProvider>SoftwareProvider</cmn:softwareProvider>
						<cmn:softwarePlatform>SoftwarePlatform</cmn:softwarePlatform>
						<cmn:softwareRelease>1</cmn:softwareRelease>
					</cmn:softwareProviderData>
					<cmn:identifier IdentifierValueType="ACCIRD">111111111</cmn:identifier>
					<cmn:accountType>PSO</cmn:accountType>
				</emp:header>
				<emp:employeeIdentifier>
                    	<emp:employeeIRD>123005015</emp:employeeIRD>
               		<emp:employeeNameOnEILine>MyNameIsEmployee1</emp:employeeNameOnEILine>
					<emp:employeeDateOfBirth>2000-01-01</emp:employeeDateOfBirth>
					<emp:employmentStartDate>2017-01-01</emp:employmentStartDate>
           		</emp:employeeIdentifier>
				<emp:updateBody>
                    	<emp:employeeIRD>123005015</emp:employeeIRD>
                    	<emp:employeeName>
                    		<emp:nameTitle>Mr</emp:nameTitle>
                    		<emp:nameFirst>John</emp:nameFirst>
                    		<emp:nameSurname>Adams</emp:nameSurname>
                    		<emp:nameMiddle>Michael</emp:nameMiddle>
                    	</emp:employeeName>
               		<emp:employeeNameOnEILine>MyNameIsEmployee1</emp:employeeNameOnEILine>
               		<emp:employmentStartDate>2018-01-12</emp:employmentStartDate>
           		    	<emp:employeeDateOfBirth>2000-01-01</emp:employeeDateOfBirth> 	
               		<emp:taxCodes>
		                   	<emp:taxCode>WT</emp:taxCode>
		                   	<emp:taxCode>CAE</emp:taxCode>
             		  	</emp:taxCodes>
             		  	<emp:employeeAddress>
             		  		<cmn:nzPostAddress>
             		  			<cmn:streetAddress>
								<cmn:streetNumber>55</cmn:streetNumber>
								<cmn:streetName>Featherston St</cmn:streetName>
	             		  		</cmn:streetAddress>
	             		  		<cmn:unit>
	             		  			<cmn:type>Floor</cmn:type>
	             		  			<cmn:number>1</cmn:number>
	             		  		</cmn:unit>
	             		  		<cmn:townCity>Wellington</cmn:townCity>
	             		  		<cmn:postCode>6011</cmn:postCode>
	             		  		<cmn:country>NZL</cmn:country>
						</cmn:nzPostAddress>
             		  	</emp:employeeAddress>
             		  	<emp:employeeEmailAddress>email@address.com</emp:employeeEmailAddress>
             		  	<emp:employeeMobilePhoneNumber>
             		  		<cmn:phoneType>CELL</cmn:phoneType>
             		  		<cmn:country>027</cmn:country>
             		  		<cmn:areaCode>023</cmn:areaCode>
             		  		<cmn:number>8234567</cmn:number>
             		  		<cmn:extension>805</cmn:extension>
             		  	</emp:employeeMobilePhoneNumber>
             		  	<emp:employeeDayPhoneNumber>
             		  		<cmn:phoneType>HOM</cmn:phoneType>
             		  		<cmn:country>064</cmn:country>
             		  		<cmn:areaCode>021</cmn:areaCode>
             		  		<cmn:number>1234567</cmn:number>
             		  		<cmn:extension>905</cmn:extension>
             		  	</emp:employeeDayPhoneNumber>
           		    	<emp:kiwiSaverStatus>AK</emp:kiwiSaverStatus>
             		  	<emp:optedOut>1</emp:optedOut>
             		  	<emp:employeeBankAccountNumber>
             		  		<cmn:nzBankStandard>
							<cmn:bank>88</cmn:bank>
							<cmn:branch>6666</cmn:branch>
							<cmn:account>22222222</cmn:account>
							<cmn:suffix>6666</cmn:suffix>
						</cmn:nzBankStandard>
             		  	</emp:employeeBankAccountNumber>
             		  	<emp:accountHolderName>
                    		<cmn:nameTitle>ATH</cmn:nameTitle>
                    		<cmn:nameFirst>AHF</cmn:nameFirst>
                    		<cmn:nameSurname>AHS</cmn:nameSurname>
                    		<cmn:nameMiddle>AHM</cmn:nameMiddle>
             		  	</emp:accountHolderName>
             		  	<emp:optedOutSignatureDate>2017-01-10</emp:optedOutSignatureDate>
           		    	<emp:validRelationship>1</emp:validRelationship>
               	</emp:updateBody>
               </emp:updateRequest>
            </upd:UpdateRequestWrapper>
         </empl:UpdateRequestMsg>
      </empl:Update>
   </soap:Body>
</soap:Envelope>